Tekla.Structures.Model.PourBreak
The PourBreak class represents a pour break in a model.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Collections.Generic;
public class Example
{
public void Example1()
{
Point startPointBeam = new Point(0.0, 0.0, 0.0);
Point endPointBeam = new Point(7200.0, 0.0, 0.0);
Beam beam = new Beam(startPointBeam, endPointBeam)
{
Profile = { ProfileString = "400*400" },
Material = { MaterialString = "Concrete_undefined" }
};
if (beam.Insert())
{
Vector[] vertices = new[]
{
new Vector(2000.0,  200.0,    0.0),
new Vector(2000.0,  200.0, -400.0),
new Vector(2000.0, -200.0, -400.0),
new Vector(2000.0, -200.0,    0.0)
};
var outerWires = new int[1][];
outerWires[0] = new int[vertices.Length];
for (int i = 0; i < vertices.Length; i++)
outerWires[0][i] = i;
var innerWires = new Dictionary<int, int[][]> { };
var pourBreak = new PourBreak { Polymesh = new FacetedBrep(vertices, outerWires, innerWires) };
bool result = pourBreak.Insert();
}
}
}

Tekla.Structures.Model.PourBreak.CreateInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of creating this pour break in the model.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PourBreak.SelectInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of selecting this pour break in the model.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PourBreak.ModifyInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of modifying this pour break in the model.
Returns:
The error code returned from the delegate.